// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let nam = 100;
// console.log(nam);

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 10;
// b = 2;
// c = 5;
// console.log(a + b + c);
// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let a = 100;
// console.log(a * 2);
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.

// let num = 67;
// console.log(num % 7);

// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let a = 10;
// b = 2;
// console.log(a + b);
// console.log(a - b);
// console.log(a * b);
// console.log(a / b);

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15;
// d = 2;
// let result = c + d;
// console.log(result);

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c.
//  Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30;
// b = 15;
// let c = a + b;
// console.log(c % 4);
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
// Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в
//  переменную result. Выведите в консоль значение переменной result.
// let a = 17;
// b = 10;
// let c = a - b;
// let d = 10;
// let result = c * d;
// console.log(result);

// 1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.
// let a = "Привет, Мир!";
// console.log(a);

// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции
// сложения строк выведите в консоль фразу 'Привет, Мир!'.
// let str1 = "Привет, ",
//   str2 = "Мир!";
// console.log(str1.concat(str2));
// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'
// let str = "Привет, *Имя*!";
// console.log(str);
// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.
// let str = "123";
// console.log(`Мне ${str} лет!`);
